docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.tex
% Created 2026-03-13 Fri 14:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{The Prologos Project - From Zachary Larson}
\date{2026-03-13}
\title{The Categorical Structure of Layered Recovery: Stratified Endofunctors on Quantale-Enriched Lattices}
\hypersetup{
 pdfauthor={The Prologos Project - From Zachary Larson},
 pdftitle={The Categorical Structure of Layered Recovery: Stratified Endofunctors on Quantale-Enriched Lattices},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Abstract}
\label{sec:org8545c93}

We identify the precise categorical structure underlying the Layered Recovery
Principle as implemented in three subsystems of the Prologos language: the logic
engine (stratified negation), the session runtime (effect ordering), and the type
checker (reactive constraint resolution). Each system faces the same fundamental
problem: recovering non-monotone behavior on a monotone propagator substrate.

We show that all three systems instantiate a common categorical pattern: a
\textbf{stratified endofunctor} on a \textbf{quantale-enriched lattice}, where the
endofunctor decomposes as a chain of monotone functors between lattices connected
by Galois connections, with non-monotone operations isolated at precisely one
barrier in the chain. The global fixpoint is the least fixpoint of the
endofunctor, computed by Kleene iteration over the stratified chain.

We prove that this structure is sufficient to recover any non-monotone operation
on a monotone substrate, provided the non-monotone operation satisfies a
\emph{stratifiability condition}: it must be expressible as a barrier between two
monotone phases. We characterize the class of non-monotone operations that
satisfy this condition and identify variants for operations that do not.
\section{1. The Three Systems}
\label{sec:org6d1645b}

Three subsystems of Prologos independently discovered and implemented the same
architectural pattern. We analyze each in turn, extracting the precise algebraic
structure.
\subsection{1.1 System I: The Logic Engine (\texttt{rel})}
\label{sec:org363ad45}

\emph{Non-monotone operation}: Negation-as-failure (NAF). If P is not derivable at
the current stratum, conclude ¬P. This is non-monotone because adding a fact P
to the database can cause ¬P to become invalid.

\emph{Implementation}: Stratified evaluation with three layers.

\begin{verbatim}
Layer 1 (Propagator Network): Unification constraints propagate through cells.
  Values refine monotonically. The network converges to a fixpoint.

Layer 2 (ATMS): Choice points create assumptions. Adding nogoods (inconsistent
  combinations) shrinks the set of valid worldviews — still monotone (the nogood
  set only grows, the valid worldview set only shrinks).

Layer 3 (Stratification Controller): Evaluate ¬P only after stratum containing
  P has reached fixpoint. This is the non-monotone barrier.
\end{verbatim}

\emph{Lattice structure}: Let U be the unification lattice (substitutions ordered by
refinement). Each stratum Sₖ operates on U. The join is unification; the bottom
is the empty substitution.

\emph{The stratified chain}:

\begin{verbatim}
S₀ ──lfp──→ U₀* ──neg──→ S₁ ──lfp──→ U₁* ──neg──→ S₂ ──lfp──→ ...
 ↑                                                              ↓
 └──────────────────── Kleene iteration ────────────────────────┘
\end{verbatim}

Where:
\begin{itemize}
\item lfp denotes the least fixpoint of monotone propagation within a stratum
\item neg denotes the non-monotone negation evaluation at the barrier
\item Uₖ* is the fixpoint of stratum k
\end{itemize}

\emph{Algebraic structure}:
\begin{itemize}
\item The unification lattice U is a quantale: substitutions compose (sequential
application σ ∘ τ) and this composition distributes over joins (most general
unifiers). The ordering is refinement: σ ≤ τ iff τ is a refinement of σ.
\item Negation evaluation neg : U* → Init(U) is not a quantale morphism (it is
anti-monotone on the truth ordering). It maps fixpoint states to initial
conditions for the next stratum.
\item Each stratum's propagation is an endofunctor Fₖ : U → U that is monotone.
The fixpoint Uₖ* = lfp(Fₖ).
\end{itemize}

\emph{Sources}: Logic Engine Design (\texttt{2026-02-24\_LOGIC\_ENGINE\_DESIGN.org} §5),
Effectful Computation on Propagators (\texttt{EFFECTFUL\_COMPUTATION\_ON\_PROPAGATORS.org} §2).
\subsection{1.2 System II: The Session Runtime (\texttt{proc})}
\label{sec:org090afd4}

\emph{Non-monotone operation}: IO effect execution. Writing to a file, sending a
message, opening a connection — these are irreversible observations that cannot
be undone, retried, or merged.

\emph{Implementation}: Five-layer architecture.

\begin{verbatim}
Layer 1 (Session Advancement): Session cells advance monotonically through
  protocol states. Each advancement is a Lamport clock tick.

Layer 2 (Data-Flow Analysis): Analyze variable bindings to derive cross-channel
  ordering edges. Monotone edge accumulation.

Layer 3 (Transitive Closure): Compute the complete partial order over effects
  by propagating ordering edges to closure. Monotone fixpoint.

Layer 4 (ATMS Branching): Maintain per-branch ordering hypotheses. Adding
  nogoods only shrinks valid worldviews — monotone.

Layer 5 (Effect Handler): Execute effects in a valid linearization of the
  resolved partial order. This is the non-monotone barrier.
\end{verbatim}

\emph{Lattice structure}: Two lattices connected by a Galois connection.

Let S be the \emph{session lattice}: session types ordered by advancement (bot →
concrete → advanced states → end). The join is the most-advanced common state.

Let E be the \emph{effect position lattice}: sets of ordering constraints (i < j)
over effect indices, ordered by inclusion. The join is set union. Transitive
closure is a closure operator on E (monotone, extensive, idempotent).

\emph{The Galois connection (α, γ)}:

\begin{verbatim}
α : S → E     (extract causal position from session state)
γ : E → S     (reconstruct remaining protocol from effect position)

α(s) ≤ e  ⟺  s ≤ γ(e)    (adjunction property)
\end{verbatim}

Both α and γ are monotone. The key insight: α preserves sequential composition.

\emph{Algebraic structure}:
\begin{itemize}
\item Both S and E are \textbf{effect quantales} (Katsumata 2014, Gordon 2021):
\begin{itemize}
\item Lattice structure (partial order with joins)
\item Sequential composition (⊕) distributes over joins
\item Ordering respects composition: i ≤ i' ∧ j ≤ j' ⟹ i ⊕ j ≤ i' ⊕ j'
\end{itemize}
\item The Galois connection (α, γ) is a \textbf{quantale morphism}: it preserves both the
lattice ordering and sequential composition.
\item Effect execution (Layer 5) is non-monotone: it selects a linearization of the
partial order and performs irreversible IO.
\end{itemize}

\emph{The stratified chain}:

\begin{verbatim}
S ──α──→ E ──tc──→ E* ──exec──→ World
↑    Galois     monotone     non-monotone
│   connection   closure       barrier
│
(session advancement propagators — monotone)
\end{verbatim}

Where tc denotes transitive closure (a monotone closure operator).

\emph{Sources}: Session Types as Effect Ordering (\texttt{2026-03-06\_SESSION\_TYPES\_AS\_EFFECT\_ORDERING.org} §4-6),
Effectful Computation (\texttt{EFFECTFUL\_COMPUTATION\_ON\_PROPAGATORS.org} §3-4).
