docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.org
** 1.3 System III: The Type Checker (Stratified Quiescence)

/Non-monotone operation/: Trait resolution commitment. Selecting a specific
instance from the set of candidates is a /choice/ — once committed, the choice
is irreversible. Instance selection can be anti-monotone: adding a more specific
instance can invalidate a previous selection.

/Implementation/: Stratified quiescence with three strata.

#+begin_example
Stratum 0 (Type Propagation): Cell writes (meta solutions → type cells),
  unification propagators, cross-domain bridges. Monotone: values only refine
  in the type lattice.

Stratum 1 (Readiness Detection): Constraint-readiness propagators scan cell
  states to derive "constraint C is ready to retry" signals. Monotone: once
  a cell becomes non-bot, readiness is permanent.

Stratum 2 (Resolution Commitment): Consume readiness signals. Execute
  resolution (retry constraint, resolve trait, solve meta). Non-monotone:
  commitment selects one instance, excluding alternatives.
#+end_example

/Lattice structure/: Three lattices forming a chain.

Let T be the /type cell lattice/: metavariable values ordered by refinement
(bot → partial types → ground types). The merge is unification.

Let R be the /readiness lattice/: sets of ready-constraint descriptors, ordered
by inclusion. The join is set union. Readiness is monotone in T: if a cell is
non-bot, the constraint is ready; more refined cells are still non-bot.

Let A be the /action lattice/: multisets of resolution actions (trait
resolution, constraint retry, hasmethod resolution), ordered by inclusion. Each
action is a data descriptor (free monad pattern) — not an executed effect.

/The functors between strata/:

#+begin_example
  α : T → R     (extract readiness from type cell states)
  β : R → A     (map readiness signals to resolution actions)
  γ : A → T     (commit resolutions → new type cell writes)
#+end_example

- α is monotone: more refined type cells produce (weakly) more readiness
  signals.
- β is monotone: more readiness signals produce more action descriptors.
- γ is *not monotone* in the general case: committing a resolution can
  invalidate other pending resolutions (e.g., solving meta ?X = Nat might
  make a trait constraint solvable but also make another constraint
  unsatisfiable). However, γ is monotone /per action/ — each individual
  resolution writes a more refined value to a type cell.

/The stratified chain (one iteration)/:

#+begin_example
  T ──lfp(S0)──→ T* ──α──→ R ──lfp(S1)──→ R* ──β──→ A ──commit──→ T'
  ↑                                                              ↓
  └──────────────── Kleene iteration (fuel=100) ────────────────┘
#+end_example

/Algebraic structure/:
- T is a quantale: type substitutions compose and composition distributes over
  the unification join.
- R is a join-semilattice (readiness sets under union). It lacks the sequential
  composition that would make it a full quantale.
- A is a free monoid (action sequences). The ordering is prefix/subset.
- α : T* → R is a Galois connection's upper adjoint (abstraction). The lower
  adjoint γ : R → T does not exist in the traditional sense because commitment
  is non-monotone. Instead, β ∘ γ : A → T is a /partial function/ — it succeeds
  only when the action is still valid (re-check guard).

/Confluence conditions/ (proved in Track 2 Phase 9):
- S0: Confluent by construction (lattice merge properties).
- S1: Confluent by construction (readiness is monotone in cell state).
- S2: Confluent under the /non-overlapping instance invariant/: each constraint
  has at most one valid resolution. Prologos enforces this — monomorphic
  instances are looked up by key, parametric instances use most-specific-wins
  with same-specificity ties rejected as ambiguous (HKT-7).

/Sources/: Track 2 Design (=2026-03-13_TRACK2_REACTIVE_RESOLUTION_DESIGN.md= §3.4),
Track 2 Phase 9 (=test-resolution-confluence-01.rkt=).

* 2. The Common Categorical Structure

** 2.1 Definition: Stratified Recovery System

A *stratified recovery system* is a tuple $(L, F_m, f_{nm}, n)$ where:

1. *L* is a complete lattice (the /substrate/).
2. *F_m : L → L* is a monotone endofunctor (the /propagation phase/).
   By Knaster-Tarski, F_m has a least fixpoint lfp(F_m).
3. *f_{nm} : L → L* is a (possibly non-monotone) function (the /barrier
   operation/).
4. *n ∈ ℕ ∪ {ω}* is the /stratification depth/ (number of strata).

The *stratified fixpoint* is computed by:

#+begin_example
  x₀ = ⊥
  For k = 0, 1, ..., n-1:
    xₖ* = lfp(F_m | initialized at xₖ)
    xₖ₊₁ = f_nm(xₖ*)
  Result = x_n*
#+end_example

This is Kleene iteration on the composition f_nm ∘ lfp(F_m), starting from ⊥.

** 2.2 The Enrichment: Quantale Structure

In all three Prologos systems, the substrate lattice L carries additional
algebraic structure: it is a *quantale*.

A quantale is a complete lattice (L, ≤, ⊔) equipped with an associative binary
operation (⊗ : L × L → L) called /sequential composition/ that distributes over
arbitrary joins:

#+begin_example
  a ⊗ (⊔ᵢ bᵢ) = ⊔ᵢ (a ⊗ bᵢ)     (left distributivity)
  (⊔ᵢ aᵢ) ⊗ b = ⊔ᵢ (aᵢ ⊗ b)     (right distributivity)
#+end_example

The three systems' quantale structures:

| System | Lattice L | Join (⊔) | Composition (⊗) |
|--------+-----------+----------+------------------|
| Logic  | Substitutions | Most general unifier | Substitution application |
| Sessions | Session states | Most-advanced state | Protocol continuation |
| Types  | Type cells | Unification | Type substitution composition |

** 2.3 The Decomposition: Inter-Stratum Galois Connections

The stratified fixpoint computation decomposes the endofunctor
(f_nm ∘ lfp(F_m)) through intermediate lattices connected by Galois connections.

In the general case, a stratified recovery system with k strata has
intermediate lattices L₀, L₁, ..., Lₖ and Galois connections:

#+begin_example
  (αᵢ, γᵢ) : Lᵢ ⇌ Lᵢ₊₁     for i = 0, ..., k-2

  where αᵢ is monotone (abstraction)
        γᵢ is monotone (concretization)
        αᵢ(x) ≤ y  ⟺  x ≤ γᵢ(y)
#+end_example

The non-monotone operation f_nm factors through the final lattice Lₖ₋₁:

#+begin_example
  f_nm = γ₀ ∘ ... ∘ γₖ₋₂ ∘ barrier ∘ αₖ₋₂ ∘ ... ∘ α₀
#+end_example

where /barrier/ : Lₖ₋₁ → Lₖ₋₁ is the non-monotone operation at the top
stratum. All other operations in the chain are monotone.

The three systems instantiate this pattern:

| System | Lattice chain | Galois connections | Barrier |
|--------+---------------+--------------------+---------|
| Logic | U → U | identity (single lattice, iterated) | neg : U* → Init(U) |
| Sessions | S → E → E* | (α,γ) : S ⇌ E (quantale morphism) | exec : E* → World |
| Types | T → R → A | α : T* → R (abstraction) | commit : A → T |

