docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.tex
\subsection{1.3 System III: The Type Checker (Stratified Quiescence)}
\label{sec:org9f622f1}

\emph{Non-monotone operation}: Trait resolution commitment. Selecting a specific
instance from the set of candidates is a \emph{choice} — once committed, the choice
is irreversible. Instance selection can be anti-monotone: adding a more specific
instance can invalidate a previous selection.

\emph{Implementation}: Stratified quiescence with three strata.

\begin{verbatim}
Stratum 0 (Type Propagation): Cell writes (meta solutions → type cells),
  unification propagators, cross-domain bridges. Monotone: values only refine
  in the type lattice.

Stratum 1 (Readiness Detection): Constraint-readiness propagators scan cell
  states to derive "constraint C is ready to retry" signals. Monotone: once
  a cell becomes non-bot, readiness is permanent.

Stratum 2 (Resolution Commitment): Consume readiness signals. Execute
  resolution (retry constraint, resolve trait, solve meta). Non-monotone:
  commitment selects one instance, excluding alternatives.
\end{verbatim}

\emph{Lattice structure}: Three lattices forming a chain.

Let T be the \emph{type cell lattice}: metavariable values ordered by refinement
(bot → partial types → ground types). The merge is unification.

Let R be the \emph{readiness lattice}: sets of ready-constraint descriptors, ordered
by inclusion. The join is set union. Readiness is monotone in T: if a cell is
non-bot, the constraint is ready; more refined cells are still non-bot.

Let A be the \emph{action lattice}: multisets of resolution actions (trait
resolution, constraint retry, hasmethod resolution), ordered by inclusion. Each
action is a data descriptor (free monad pattern) — not an executed effect.

\emph{The functors between strata}:

\begin{verbatim}
α : T → R     (extract readiness from type cell states)
β : R → A     (map readiness signals to resolution actions)
γ : A → T     (commit resolutions → new type cell writes)
\end{verbatim}

\begin{itemize}
\item α is monotone: more refined type cells produce (weakly) more readiness
signals.
\item β is monotone: more readiness signals produce more action descriptors.
\item γ is \textbf{not monotone} in the general case: committing a resolution can
invalidate other pending resolutions (e.g., solving meta ?X = Nat might
make a trait constraint solvable but also make another constraint
unsatisfiable). However, γ is monotone \emph{per action} — each individual
resolution writes a more refined value to a type cell.
\end{itemize}

\emph{The stratified chain (one iteration)}:

\begin{verbatim}
T ──lfp(S0)──→ T* ──α──→ R ──lfp(S1)──→ R* ──β──→ A ──commit──→ T'
↑                                                              ↓
└──────────────── Kleene iteration (fuel=100) ────────────────┘
\end{verbatim}

\emph{Algebraic structure}:
\begin{itemize}
\item T is a quantale: type substitutions compose and composition distributes over
the unification join.
\item R is a join-semilattice (readiness sets under union). It lacks the sequential
composition that would make it a full quantale.
\item A is a free monoid (action sequences). The ordering is prefix/subset.
\item α : T* → R is a Galois connection's upper adjoint (abstraction). The lower
adjoint γ : R → T does not exist in the traditional sense because commitment
is non-monotone. Instead, β ∘ γ : A → T is a \emph{partial function} — it succeeds
only when the action is still valid (re-check guard).
\end{itemize}

\emph{Confluence conditions} (proved in Track 2 Phase 9):
\begin{itemize}
\item S0: Confluent by construction (lattice merge properties).
\item S1: Confluent by construction (readiness is monotone in cell state).
\item S2: Confluent under the \emph{non-overlapping instance invariant}: each constraint
has at most one valid resolution. Prologos enforces this — monomorphic
instances are looked up by key, parametric instances use most-specific-wins
with same-specificity ties rejected as ambiguous (HKT-7).
\end{itemize}

\emph{Sources}: Track 2 Design (\texttt{2026-03-13\_TRACK2\_REACTIVE\_RESOLUTION\_DESIGN.md} §3.4),
Track 2 Phase 9 (\texttt{test-resolution-confluence-01.rkt}).
\section{2. The Common Categorical Structure}
\label{sec:org847acb7}

\subsection{2.1 Definition: Stratified Recovery System}
\label{sec:orgfd76091}

A \textbf{stratified recovery system} is a tuple \((L, F_m, f_{nm}, n)\) where:

\begin{enumerate}
\item \textbf{L} is a complete lattice (the \emph{substrate}).
\item \textbf{F\textsubscript{m} : L → L} is a monotone endofunctor (the \emph{propagation phase}).
By Knaster-Tarski, F\textsubscript{m} has a least fixpoint lfp(F\textsubscript{m}).
\item \textbf{f\textsubscript{nm} : L → L} is a (possibly non-monotone) function (the \emph{barrier
operation}).
\item \textbf{n ∈ ℕ ∪ \{ω\}} is the \emph{stratification depth} (number of strata).
\end{enumerate}

The \textbf{stratified fixpoint} is computed by:

\begin{verbatim}
x₀ = ⊥
For k = 0, 1, ..., n-1:
  xₖ* = lfp(F_m | initialized at xₖ)
  xₖ₊₁ = f_nm(xₖ*)
Result = x_n*
\end{verbatim}

This is Kleene iteration on the composition f\textsubscript{nm} ∘ lfp(F\textsubscript{m}), starting from ⊥.
\subsection{2.2 The Enrichment: Quantale Structure}
\label{sec:orgeb940ec}

In all three Prologos systems, the substrate lattice L carries additional
algebraic structure: it is a \textbf{quantale}.

A quantale is a complete lattice (L, ≤, ⊔) equipped with an associative binary
operation (⊗ : L × L → L) called \emph{sequential composition} that distributes over
arbitrary joins:

\begin{verbatim}
a ⊗ (⊔ᵢ bᵢ) = ⊔ᵢ (a ⊗ bᵢ)     (left distributivity)
(⊔ᵢ aᵢ) ⊗ b = ⊔ᵢ (aᵢ ⊗ b)     (right distributivity)
\end{verbatim}

The three systems' quantale structures:

\begin{center}
\begin{tabular}{llll}
System & Lattice L & Join (⊔) & Composition (⊗)\\
\hline
Logic & Substitutions & Most general unifier & Substitution application\\
Sessions & Session states & Most-advanced state & Protocol continuation\\
Types & Type cells & Unification & Type substitution composition\\
\end{tabular}
\end{center}
\subsection{2.3 The Decomposition: Inter-Stratum Galois Connections}
\label{sec:org6fbdade}

The stratified fixpoint computation decomposes the endofunctor
(f\textsubscript{nm} ∘ lfp(F\textsubscript{m})) through intermediate lattices connected by Galois connections.

In the general case, a stratified recovery system with k strata has
intermediate lattices L₀, L₁, \ldots{}, Lₖ and Galois connections:

\begin{verbatim}
(αᵢ, γᵢ) : Lᵢ ⇌ Lᵢ₊₁     for i = 0, ..., k-2

where αᵢ is monotone (abstraction)
      γᵢ is monotone (concretization)
      αᵢ(x) ≤ y  ⟺  x ≤ γᵢ(y)
\end{verbatim}

The non-monotone operation f\textsubscript{nm} factors through the final lattice Lₖ₋₁:

\begin{verbatim}
f_nm = γ₀ ∘ ... ∘ γₖ₋₂ ∘ barrier ∘ αₖ₋₂ ∘ ... ∘ α₀
\end{verbatim}

where \emph{barrier} : Lₖ₋₁ → Lₖ₋₁ is the non-monotone operation at the top
stratum. All other operations in the chain are monotone.

The three systems instantiate this pattern:

\begin{center}
\begin{tabular}{llll}
System & Lattice chain & Galois connections & Barrier\\
\hline
Logic & U → U & identity (single lattice, iterated) & neg : U* → Init(U)\\
Sessions & S → E → E* & (α,γ) : S ⇌ E (quantale morphism) & exec : E* → World\\
Types & T → R → A & α : T* → R (abstraction) & commit : A → T\\
\end{tabular}
\end{center}
