docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.tex
\subsection{2.4 Theorem: Stratification Preserves Fixpoint Equivalence}
\label{sec:org61786d8}

\textbf{Theorem} (Fixpoint Equivalence). Let \((L, F_m, f_{nm}, n)\) be a stratified
recovery system. If f\textsubscript{nm} is \emph{stratifiable} — i.e., the composition
f\textsubscript{nm} ∘ lfp(F\textsubscript{m}) is monotone — then the stratified fixpoint equals the direct
fixpoint:

\begin{verbatim}
lfp(f_nm ∘ lfp(F_m)) = stratified_fixpoint(L, F_m, f_nm, n)
\end{verbatim}

\emph{Proof sketch}: Define G = f\textsubscript{nm} ∘ lfp(F\textsubscript{m}) : L → L. Since lfp(F\textsubscript{m}) is
monotone (as a function of the initialization point, by the parametric fixpoint
theorem — Cousot \& Cousot 1979) and f\textsubscript{nm} is stratifiable (monotone when composed
with lfp), G is monotone. By Knaster-Tarski, G has a least fixpoint lfp(G).
The stratified computation is exactly Kleene iteration of G starting from ⊥:

\begin{verbatim}
x₀ = ⊥,  xₖ₊₁ = G(xₖ) = f_nm(lfp(F_m | xₖ))
\end{verbatim}

For monotone G on a complete lattice, Kleene iteration converges to lfp(G)
(possibly at a transfinite ordinal for general complete lattices; at ω for
algebraic/continuous lattices, which all three systems are). □

\textbf{Corollary} (Confluence). If the stratified fixpoint equals the direct fixpoint
and S0 is confluent (lattice merge properties), then the overall computation is
confluent — the result is independent of the order in which propagators fire
within each stratum.

\emph{Note}: The stratifiability condition is not always satisfied. System III (type
checker) satisfies it only under the non-overlapping instance invariant. If
overlapping instances existed, f\textsubscript{nm} ∘ lfp(F\textsubscript{m}) would not be monotone (adding
type information could change which instance is selected, leading to a different
fixpoint). This is why Prologos rejects overlapping instances — it is a
\emph{semantic requirement for confluence}, not merely a design choice.
\subsection{2.5 The Common Structure: Diagram}
\label{sec:org75e2a55}

\begin{verbatim}
                ┌─────────────────────────┐
                │   STRATIFIED RECOVERY    │
                │       SYSTEM             │
                └───────────┬─────────────┘
                            │
          ┌─────────────────┼─────────────────┐
          │                 │                 │
┌─────────▼──────┐ ┌───────▼────────┐ ┌──────▼──────────┐
│ System I: rel  │ │ System II: proc│ │ System III: tc  │
│ (Logic Engine) │ │ (Sessions)     │ │ (Type Checker)  │
└─────────┬──────┘ └───────┬────────┘ └──────┬──────────┘
          │                │                 │
          ▼                ▼                 ▼
┌──────────────────────────────────────────────────────┐
│         QUANTALE-ENRICHED LATTICE  (L, ≤, ⊗)        │
│                                                      │
│  Monotone endofunctor Fm : L → L                     │
│  Fixpoint computation: lfp(Fm) via propagator network│
└──────────────────────┬───────────────────────────────┘
                       │
          ┌────────────▼──────────────┐
          │  GALOIS CONNECTION CHAIN   │
          │                           │
          │  L₀ ⇌ L₁ ⇌ ... ⇌ Lₖ₋₁   │
          │  (αᵢ, γᵢ) monotone pairs  │
          └────────────┬──────────────┘
                       │
          ┌────────────▼──────────────┐
          │  NON-MONOTONE BARRIER     │
          │                           │
          │  barrier : Lₖ₋₁ → L₀     │
          │  (negation / execution /  │
          │   commitment)             │
          └────────────┬──────────────┘
                       │
          ┌────────────▼──────────────┐
          │  KLEENE ITERATION         │
          │                           │
          │  Iterate (barrier ∘ lfp)  │
          │  until global fixpoint    │
          └───────────────────────────┘
\end{verbatim}
\section{3. The Quantale Morphism as Bridge}
\label{sec:orgd509611}

\subsection{3.1 Why Quantales, Not Just Lattices?}
\label{sec:org137e16e}

The lattice structure alone suffices for fixpoint computation (Knaster-Tarski).
The quantale structure — the sequential composition ⊗ — is what makes the
Galois connections between systems meaningful.

Without ⊗, a Galois connection (α, γ) : L ⇌ M between lattices preserves only
order information. With ⊗, a \textbf{quantale morphism} preserves both order AND
sequential composition:

\begin{verbatim}
α(a ⊗ b) = α(a) ⊗' α(b)     (preserves composition)
α(⊔ᵢ aᵢ) = ⊔'ᵢ α(aᵢ)        (preserves joins)
\end{verbatim}

This is critical for Prologos because the systems don't just compute values —
they compute \emph{sequences of operations}. Substitution application, protocol
continuation, and type-checking steps all have sequential structure. The quantale
morphism guarantees that the sequential structure is preserved across the Galois
bridge.

In System II (sessions), this means: the session protocol's sequential structure
(send, then receive, then end) maps faithfully to the effect ordering's
sequential structure (effect at position 0 before effect at position 1 before
effect at position 2). The morphism doesn't just preserve ordering — it preserves
the \emph{reason} for the ordering.
\subsection{3.2 The Bridge Pattern in Implementation}
\label{sec:org9fa435e}

In Prologos, the Galois connection between domains is implemented as a
\textbf{bridge propagator} — a propagator that watches cells in one domain and writes
to cells in another:

\begin{verbatim}
bridge-propagator : Cell[L] × Cell[M] → Propagator
  When Cell[L] refines from l to l':
    write α(l') to Cell[M]      (α is the abstraction)
  When Cell[M] refines from m to m':
    write γ(m') to Cell[L]      (γ is the concretization)
\end{verbatim}

The monotonicity of α and γ guarantees that the bridge propagator is a valid
monotone propagator — it can participate in the propagator network's fixpoint
computation without violating confluence.

Existing bridges in Prologos:
\begin{itemize}
\item Type ⇌ Session bridge (\texttt{session-propagators.rkt})
\item Type ⇌ Interval bridge (from abstract interpretation work)
\item Session ⇌ Effect Position bridge (proposed in Architecture D)
\end{itemize}

Each bridge is a quantale morphism instantiated as a pair of propagators.
\subsection{3.3 Composition of Galois Connections}
\label{sec:org85a6f89}

Galois connections compose: if (α₁, γ₁) : L ⇌ M and (α₂, γ₂) : M ⇌ N, then
(α₂ ∘ α₁, γ₁ ∘ γ₂) : L ⇌ N is also a Galois connection.

This means the inter-stratum connections compose into a single Galois connection
from the substrate lattice to the barrier lattice. For System III (type checker):

\begin{verbatim}
(α₂ ∘ α₁, γ₁ ∘ γ₂) : T ⇌ A

where α₁ : T* → R (readiness extraction)
      α₂ : R* → A (action construction)
      γ₂ : A → R (action interpretation)
      γ₁ : R → T (resolution commitment)
\end{verbatim}

The \emph{composed} Galois connection maps directly from type cell fixpoints to
resolution actions. This is exactly what the stratified quiescence loop computes
— but the categorical perspective reveals that the intermediate lattice R
(readiness) is not essential; it is a \emph{factorization} of the composed connection
that makes the computation more efficient (readiness can be computed incrementally
by propagators).
\section{4. Formal Statements}
\label{sec:org21a9a52}

We now state the key results precisely.
\subsection{4.1 Definition: Stratifiable Operation}
\label{sec:orgbc321c2}

A function f : L → L on a complete lattice L is \emph{stratifiable with respect to
a monotone endofunctor F : L → L} if the composition f ∘ lfp(F) : L → L is
monotone, where lfp(F) denotes the parametric least fixpoint of F (which is
monotone in the initialization point by Cousot \& Cousot 1979).
