docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.tex
\subsection{4.2 Theorem: Generalized Stratification}
\label{sec:org9fb1a80}

Let L be a complete lattice, F : L → L monotone, and f : L → L stratifiable
with respect to F. Define the stratified iteration:

\begin{verbatim}
G = f ∘ lfp(F) : L → L

x₀ = ⊥
xₙ₊₁ = G(xₙ)
\end{verbatim}

Then:
\begin{enumerate}
\item G is monotone (by definition of stratifiability).
\item lfp(G) exists (by Knaster-Tarski).
\item The Kleene chain x₀ ≤ x₁ ≤ \ldots{} converges to lfp(G).
\item lfp(G) is the unique minimal solution to: x = f(lfp(F | x)).
\end{enumerate}
\subsection{4.3 Theorem: Quantale Morphism Preservation}
\label{sec:org69e756b}

Let (Q₁, ≤₁, ⊗₁) and (Q₂, ≤₂, ⊗₂) be quantales and (α, γ) : Q₁ ⇌ Q₂ a
Galois connection that is also a quantale morphism (α preserves ⊗ and ⊔). If
F₁ : Q₁ → Q₁ and F₂ : Q₂ → Q₂ are monotone endofunctors such that
α ∘ F₁ = F₂ ∘ α (the bridge commutes with propagation), then:

\begin{verbatim}
α(lfp(F₁)) ≤ lfp(F₂)
\end{verbatim}

and if additionally γ ∘ F₂ ≤ F₁ ∘ γ, then:

\begin{verbatim}
α(lfp(F₁)) = lfp(F₂)
\end{verbatim}

\emph{This is the soundness theorem for cross-domain bridges.}
It guarantees that fixpoints computed in one domain (e.g., session types) map
correctly to fixpoints in another domain (e.g., effect positions).
\subsection{4.4 Corollary: Confluence Under Non-Overlapping Resolution}
\label{sec:org04f0d80}

For System III (type checker), the barrier operation (trait resolution
commitment) is stratifiable if and only if the instance resolution function is
\emph{deterministic} — i.e., for each (trait, type-args) pair, there is at most one
valid instance.

Under the non-overlapping instance invariant enforced by Prologos (monomorphic
lookup by key, parametric most-specific-wins, same-specificity ties rejected as
HKT-7 ambiguity), the resolution function is deterministic, hence stratifiable,
hence the stratified fixpoint is confluent.

This result was verified empirically by Track 2 Phase 9 (19 confluence tests,
randomized evaluation order, deterministic results).
\section{5. Relationship to Approximation Fixpoint Theory}
\label{sec:org7fdfd5c}

\subsection{5.1 The Connection}
\label{sec:org80f0459}

Approximation Fixpoint Theory (AFT), developed by Denecker, Marek, and
Truszczyński (2000, 2004), provides an algebraic framework for fixpoints of
non-monotone operators using \emph{approximating operators} on bilattices.

The key construction: given a non-monotone operator O : L → L on a complete
lattice L, define an approximating operator A : L² → L² on the bilattice L²
(pairs (x, y) where x ≤ y, ordered by the \emph{precision} ordering ≤\textsubscript{p}), such that
A is monotone with respect to ≤\textsubscript{p}. The fixpoints of A approximate the fixpoints
of O.
\subsection{5.2 Layered Recovery as a Special Case of AFT}
\label{sec:orgfe00435}

Our stratified recovery systems can be seen as a restricted case of AFT where:

\begin{enumerate}
\item The approximating operator A decomposes into a chain of Galois connections
(our inter-stratum functors).
\item The bilattice structure is implicit in the stratification: the lower bound
of the approximation is the fixpoint of the monotone phase (lfp(F\textsubscript{m})), and
the upper bound is determined by the barrier operation.
\item The precision ordering corresponds to the number of strata computed:
more strata = more precise approximation.
\end{enumerate}

However, Layered Recovery is \emph{more structured} than general AFT because:
\begin{itemize}
\item The monotone and non-monotone phases are cleanly separated (not interleaved).
\item The quantale enrichment provides sequential composition, which AFT does not
require.
\item The Galois connections between strata provide soundness guarantees that
general approximating operators do not.
\end{itemize}
\subsection{5.3 What AFT Offers for Future Extensions}
\label{sec:org7dd2d02}

AFT provides semantics for operations that Layered Recovery currently does not
handle well:

\begin{itemize}
\item \textbf{Well-founded semantics}: For self-referential negation (P ← ¬P), AFT assigns
the well-founded model (unknown). Layered Recovery's stratification rejects
this as unstratifiable. AFT provides a graceful degradation.
\item \textbf{Stable models}: For programs with multiple stable fixpoints (non-deterministic
choice), AFT characterizes all stable models. Layered Recovery computes one
fixpoint (the least). AFT could extend the ATMS layer to enumerate alternatives.
\item \textbf{Three-valued fixpoints}: AFT's bilattice naturally supports three-valued logic
(true, false, unknown). This could extend Prologos's type checker to track
constraints whose satisfiability is not yet determined, rather than failing
eagerly.
\end{itemize}
\section{6. Variants and Approaches for Non-Monotonic Domains}
\label{sec:orgefa7a79}

\subsection{6.1 Classification of Non-Monotone Operations}
\label{sec:org416f26a}

Not all non-monotone operations are stratifiable. We classify them:
\subsubsection{Class A: Stratifiable (barrier-compatible)}
\label{sec:orgb870b70}

The operation f : L → L is stratifiable if f ∘ lfp(F) is monotone. This means
adding more information to the substrate's fixpoint never reverses the barrier
operation's output.

\emph{Examples}:
\begin{itemize}
\item Negation-as-failure (when the program is stratifiable)
\item Effect execution (when the effect ordering is derived from a monotone source)
\item Trait resolution commitment (under non-overlapping instances)
\end{itemize}

\emph{Approach}: Direct application of the Layered Recovery Principle. Insert a
barrier between the monotone fixpoint and the non-monotone operation.
\subsubsection{Class B: Locally Stratifiable (barrier-compatible with context restriction)}
\label{sec:org3ad20d0}

The operation f is not globally stratifiable but becomes stratifiable when
restricted to a subset of the lattice. This typically happens when non-monotonicity
arises only for certain value combinations.

\emph{Examples}:
\begin{itemize}
\item Overlapping instance resolution (stratifiable for non-overlapping subsets)
\item Aggregation with non-monotone aggregates (e.g., average — stratifiable when
the set being aggregated is fixed)
\end{itemize}

\emph{Approach}: \emph{Dynamic stratification}. Partition the lattice at runtime into
regions where f is stratifiable, and process each region at a separate barrier.
This is analogous to local stratification in Datalog.
\subsubsection{Class C: Anti-Monotone (requires bilattice or ATMS)}
\label{sec:org7e951e1}

The operation f is anti-monotone: more input information decreases the output.
Classical negation (¬) is the canonical example.

\emph{Examples}:
\begin{itemize}
\item Classical negation (not NAF — actual logical negation)
\item Set complement
\item Constraint \emph{retraction} (removing a previously-added constraint)
\end{itemize}

\emph{Approach}: Use AFT's bilattice construction. Lift the operation to L² where
the approximating operator is monotone. Or use the ATMS: treat the anti-monotone
operation's inputs as hypotheses, compute fixpoints for each hypothesis set,
and select the consistent worldview.
\subsubsection{Class D: Chaotic (no fixpoint guarantee)}
\label{sec:org0f809dc}

The operation has no monotonicity or anti-monotonicity structure. Applying it
repeatedly may oscillate without converging.

\emph{Examples}:
\begin{itemize}
\item Arbitrary function composition with side effects
\item Operations that depend on evaluation order (inherently non-confluent)
\end{itemize}

\emph{Approach}: \emph{Bounded iteration with fuel}. Iterate the stratified chain up to
a fuel limit (as System III does with fuel=100). If convergence is not reached,
report an error. This is not a theoretical guarantee — it is a pragmatic safety
valve. Alternatively, impose ordering constraints to make the operation
deterministic (converting Class D to Class A at the cost of parallelism).
