docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.tex
\subsection{6.2 The Adaptation Recipe}
\label{sec:org2688645}

For any new non-monotonic domain:

\begin{enumerate}
\item \textbf{Identify the substrate quantale (L, ≤, ⊗)}: What is the lattice of partial
information? What is sequential composition? What is the join (information merge)?

\item \textbf{Identify the non-monotone operation f}: What operation on L violates
monotonicity? Classify it (A, B, C, or D above).

\item \textbf{For Class A}: Define the monotone propagation phase F\textsubscript{m} and verify
stratifiability. Insert a single barrier.

\item \textbf{For Class B}: Identify the stratifiable partitions. Design dynamic
stratification that detects partition boundaries at runtime.

\item \textbf{For Class C}: Choose between AFT (bilattice approximation) and ATMS
(hypothetical reasoning). AFT is simpler for pure logic; ATMS is better
when the non-monotone operation interacts with choice.

\item \textbf{For Class D}: Apply fuel-bounded iteration. Consider whether ordering
constraints can reduce to Class A.

\item \textbf{If cross-domain interaction is needed}: Define a Galois connection
(α, γ) : L ⇌ M between the new domain and existing domains. Verify that
it is a quantale morphism (preserves ⊗). Implement as a bridge propagator.
\end{enumerate}
\subsection{6.3 Specific Future Applications in Prologos}
\label{sec:org475e38f}

\begin{center}
\begin{tabular}{llll}
Domain & Non-Monotone Operation & Class & Approach\\
\hline
Refinement types & Predicate weakening under subtyping & B & Dynamic stratification by predicate structure\\
Dependent types & Type-level computation with recursion & D (bounded) & Fuel-bounded normalization (already exists)\\
Module system & Re-export shadowing & A & Barrier at module boundary\\
Incremental compilation & Definition invalidation & C & ATMS with assumptions per definition\\
Proof search & Backtracking & C & ATMS (existing)\\
Probabilistic types & Bayesian conditioning (non-monotone on probabilities) & B & Stratify by observation order\\
\end{tabular}
\end{center}
\section{7. Implications and Conclusions}
\label{sec:orgaf133f8}

\subsection{7.1 What the Categorical Structure Tells Us}
\label{sec:org654e302}

The three implementations of Layered Recovery are not \emph{analogous} — they are
\emph{instances of the same mathematical structure}. The common structure is a
stratified endofunctor on a quantale-enriched lattice, with Galois connections
between strata and a non-monotone barrier at exactly one point in the chain.

This is not a coincidence. The CALM theorem (Hellerstein 2011) tells us that
non-monotone operations require coordination, and that monotone operations do
not. The Layered Recovery Principle is the \emph{minimal} coordination strategy: all
monotone reasoning happens coordination-free in the propagator network, and the
single barrier provides the coordination required by the CALM theorem. The
quantale enrichment ensures that sequential structure is preserved across
domain bridges.
\subsection{7.2 What This Means for Implementation}
\label{sec:org113a45b}

For implementers, the categorical structure provides:

\begin{enumerate}
\item \textbf{A checklist}: For each new domain, identify the lattice, the composition,
the non-monotone operation, and its class. The categorical structure tells
you exactly what infrastructure is needed.

\item \textbf{A correctness criterion}: If your Galois connection is a quantale morphism
and your barrier operation is stratifiable, confluence is guaranteed. If any
of these conditions fails, the structure tells you exactly where the problem
is.

\item \textbf{A composition principle}: Galois connections compose. Bridge propagators
compose. New domains can be added to the propagator network without modifying
existing domains — just add a bridge.
\end{enumerate}
\subsection{7.3 What This Means for Theorists}
\label{sec:org4c0648c}

The contribution is the identification of quantale enrichment as the key
structure that distinguishes Layered Recovery from general stratified fixpoint
computation. Lattice-theoretic stratification (Datalog, AFT) handles the
fixpoint side. The quantale morphism handles the \emph{sequential composition} side —
which is essential for programming language semantics where operations have
causal order.

The three systems demonstrate that the same categorical pattern arises
independently in logic programming (unification quantale), protocol verification
(session quantale), and type inference (substitution quantale). This suggests
the pattern is fundamental to any system that combines monotone constraint
propagation with non-monotone decision procedures.
\subsection{7.4 Open Questions}
\label{sec:orgc61c6f5}

\begin{enumerate}
\item \textbf{Is there a 2-categorical structure?} The Galois connections between domains
are 1-cells in a 2-category. Do the bridge propagators form 2-cells? If so,
what additional coherence conditions arise?

\item \textbf{Can the ATMS be characterized as a specific stratification?} Currently, the
ATMS is treated as a separate layer. Can it be unified into the stratified
endofunctor framework — perhaps as an internal hom in the quantale?

\item \textbf{What is the complexity of stratifiability checking?} For System III, we
verify stratifiability by enforcing non-overlapping instances (a syntactic
condition). Is there a general decision procedure for stratifiability of
barrier operations?

\item \textbf{Quantaloid enrichment}: When multiple quantales interact via multiple Galois
connections, the natural home is a \emph{quantaloid} (a category enriched over
quantales). Does the full Prologos propagator network, with all its
cross-domain bridges, form a quantaloid-enriched category?
\end{enumerate}
\section{8. References}
\label{sec:orgfad1baf}

\subsection{8.1 Categorical and Algebraic Foundations}
\label{sec:orgec69fb9}

\begin{itemize}
\item Rosenthal, K.I. (1990). \emph{Quantales and Their Applications}. Longman.
\item Stubbe, I. (2013). "An introduction to quantaloid-enriched categories."
\href{https://www-lmpa.univ-littoral.fr/\~stubbe/PDF/SurveyQCats.pdf}{PDF}
\item Paseka, J. \& Rosický, J. (2000). "Quantales." In \emph{Current Research in
Operational Quantum Logic}.
\href{https://www.sciencedirect.com/science/article/abs/pii/S1570795407050061}{ScienceDirect}
\item Fong, B. \& Spivak, D.I. (2019). \emph{Seven Sketches in Compositionality}. §1.3
Galois Connections.
\href{https://math.libretexts.org/Bookshelves/Applied\_Mathematics/Seven\_Sketches\_in\_Compositionality:\_An\_Invitation\_to\_Applied\_Category\_Theory\_(Fong\_and\_Spivak)/01:\_Generative\_Effects\_-\_Orders\_and\_Adjunctions/1.03:\_Galois\_Connections}{LibreTexts}
\end{itemize}
\subsection{8.2 Effect Systems and Graded Monads}
\label{sec:org0198fb9}

\begin{itemize}
\item Katsumata, S. (2014). "Parametric effect monads and semantics of effect
systems." \emph{POPL 2014}.
\href{https://www.researchgate.net/publication/262368930\_Parametric\_Effect\_Monads\_and\_Semantics\_of\_Effect\_Systems}{ResearchGate}
\item Gordon, C.S. (2021). "Lifting Sequential Effects to Indexed
Computation Types." \emph{ESOP 2021}.
\item Orchard, D. et al. (2020). "Unifying graded and parameterised monads."
\href{https://arxiv.org/pdf/2001.10274}{arXiv}
\item Uustalu, T. (2018). "Graded monads and quantified computational effects."
\href{https://mta.ca/\~rrosebru/FMCS2018/Slides/Uustalu.pdf}{Slides}
\item nLab. "Graded monad."
\href{https://ncatlab.org/nlab/show/graded+monad}{nLab}
\item Barreto, S. \& Milius, S. (2025). "A Category-Theoretic Framework for
Dependent Effect Systems."
\href{https://arxiv.org/html/2601.14846}{arXiv}
\end{itemize}
