docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.org
** 8.3 Fixpoint Theory and Stratification

- Cousot, P. & Cousot, R. (1977). "Abstract interpretation: a unified lattice
  model for static analysis." /POPL 1977/.
- Cousot, P. & Cousot, R. (2014). "A Galois connection calculus for abstract
  interpretation." /POPL 2014/.
  [[https://www.di.ens.fr/~cousot/publications.www/CousotCousot-POPL14-ACM-p2-3-2014.pdf][PDF]]
- Denecker, M. et al. (2000, 2004). Approximation Fixpoint Theory.
  [[https://proceedings.kr.org/2021/32/kr2021-0032-heyninck-et-al.pdf][Recent extension]]
- Heyninck, J. et al. (2025). "A Category-Theoretic Perspective on
  Approximation Fixpoint Theory."
  [[https://arxiv.org/pdf/2502.09234][arXiv]]
  [[https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/categorytheoretic-perspective-on-higherorder-approximation-fixpoint-theory/D3A56D482FE54B7DA41C155021088E39][Cambridge]]

** 8.4 CALM Theorem and Distributed Monotonicity

- Hellerstein, J.M. (2010, 2019). "Keeping CALM: When Distributed Consistency
  is Easy." /CACM/.
  [[https://arxiv.org/abs/1901.01930][arXiv]]
  [[https://cacm.acm.org/research/keeping-calm/][ACM]]
- Conway, N. et al. (2012). "Logic and Lattices for Distributed Programming."
  [[https://dsf.berkeley.edu/papers/UCB-lattice-tr.pdf][PDF]]
- Alvaro, P. et al. (2011). "Consistency Analysis in Bloom: a CALM and
  Collected Approach." /CIDR 2011/.
  [[https://people.ucsc.edu/~palvaro/cidr11.pdf][PDF]]

** 8.5 Propagator Networks

- Radul, A. & Sussman, G.J. (2009). "The Art of the Propagator." MIT CSAIL
  Tech Report.
- Radul, A. (2009). /Propagation Networks: A Flexible and Expressive Substrate
  for Computation/. PhD thesis, MIT.

** 8.6 Session Types

- Caires, L. & Pfenning, F. (2010). "Session Types as Intuitionistic Linear
  Propositions." /CONCUR 2010/.
- Wadler, P. (2012). "Propositions as Sessions." /ICFP 2012/.
- Atkey, R. (2009). "Parameterised Notions of Computation." /JFP 19(3-4)/.

** 8.7 Datalog and Non-Monotonic Reasoning

- Madsen, M. et al. (2024). "From Datalog to Flix: A Declarative Language for
  Fixed Points on Lattices."
  [[https://inst.eecs.berkeley.edu/~cs294-260/sp24/2024-02-12-flix][Berkeley]]
- Charalambidis, A. et al. (2025). "The Power of Negation in Higher-Order
  Datalog." /TPLP/.
  [[https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/power-of-negation-in-higherorder-datalog/F29B686E15B1D940647C9C500E335194][Cambridge]]
- Kuper, L. & Newton, R.R. (2023). "Breaking the Negative Cycle." /ECOOP 2023/.
  [[https://drops.dagstuhl.de/storage/00lipics/lipics-vol263-ecoop2023/LIPIcs.ECOOP.2023.31/LIPIcs.ECOOP.2023.31.pdf][PDF]]

** 8.8 Prologos Internal Documents

- =EFFECTFUL_COMPUTATION_ON_PROPAGATORS.org= — Layered Recovery Principle (canonical)
- =2026-03-06_SESSION_TYPES_AS_EFFECT_ORDERING.org= — System II design
- =2026-02-24_LOGIC_ENGINE_DESIGN.org= — System I design
- =2026-03-13_TRACK2_REACTIVE_RESOLUTION_DESIGN.md= — System III design
- =2026-02-27_1026_GALOIS_CONNECTIONS_ABSTRACT_INTERPRETATION.md= — Galois connections research
- =2026-03-11_PROPAGATOR_FIRST_PIPELINE_AUDIT.md= — Full system audit
- =DESIGN_PRINCIPLES.org= — Data Orientation principle
