docs/research/2026-03-13_LAYERED_RECOVERY_CATEGORICAL_ANALYSIS.tex
\subsection{8.3 Fixpoint Theory and Stratification}
\label{sec:org0ebc88e}

\begin{itemize}
\item Cousot, P. \& Cousot, R. (1977). "Abstract interpretation: a unified lattice
model for static analysis." \emph{POPL 1977}.
\item Cousot, P. \& Cousot, R. (2014). "A Galois connection calculus for abstract
interpretation." \emph{POPL 2014}.
\href{https://www.di.ens.fr/\~cousot/publications.www/CousotCousot-POPL14-ACM-p2-3-2014.pdf}{PDF}
\item Denecker, M. et al. (2000, 2004). Approximation Fixpoint Theory.
\href{https://proceedings.kr.org/2021/32/kr2021-0032-heyninck-et-al.pdf}{Recent extension}
\item Heyninck, J. et al. (2025). "A Category-Theoretic Perspective on
Approximation Fixpoint Theory."
\href{https://arxiv.org/pdf/2502.09234}{arXiv}
\href{https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/categorytheoretic-perspective-on-higherorder-approximation-fixpoint-theory/D3A56D482FE54B7DA41C155021088E39}{Cambridge}
\end{itemize}
\subsection{8.4 CALM Theorem and Distributed Monotonicity}
\label{sec:org8493005}

\begin{itemize}
\item Hellerstein, J.M. (2010, 2019). "Keeping CALM: When Distributed Consistency
is Easy." \emph{CACM}.
\href{https://arxiv.org/abs/1901.01930}{arXiv}
\href{https://cacm.acm.org/research/keeping-calm/}{ACM}
\item Conway, N. et al. (2012). "Logic and Lattices for Distributed Programming."
\href{https://dsf.berkeley.edu/papers/UCB-lattice-tr.pdf}{PDF}
\item Alvaro, P. et al. (2011). "Consistency Analysis in Bloom: a CALM and
Collected Approach." \emph{CIDR 2011}.
\href{https://people.ucsc.edu/\~palvaro/cidr11.pdf}{PDF}
\end{itemize}
\subsection{8.5 Propagator Networks}
\label{sec:org3571a28}

\begin{itemize}
\item Radul, A. \& Sussman, G.J. (2009). "The Art of the Propagator." MIT CSAIL
Tech Report.
\item Radul, A. (2009). \emph{Propagation Networks: A Flexible and Expressive Substrate
for Computation}. PhD thesis, MIT.
\end{itemize}
\subsection{8.6 Session Types}
\label{sec:orga3fdac7}

\begin{itemize}
\item Caires, L. \& Pfenning, F. (2010). "Session Types as Intuitionistic Linear
Propositions." \emph{CONCUR 2010}.
\item Wadler, P. (2012). "Propositions as Sessions." \emph{ICFP 2012}.
\item Atkey, R. (2009). "Parameterised Notions of Computation." \emph{JFP 19(3-4)}.
\end{itemize}
\subsection{8.7 Datalog and Non-Monotonic Reasoning}
\label{sec:org5b3509b}

\begin{itemize}
\item Madsen, M. et al. (2024). "From Datalog to Flix: A Declarative Language for
Fixed Points on Lattices."
\href{https://inst.eecs.berkeley.edu/\~cs294-260/sp24/2024-02-12-flix}{Berkeley}
\item Charalambidis, A. et al. (2025). "The Power of Negation in Higher-Order
Datalog." \emph{TPLP}.
\href{https://www.cambridge.org/core/journals/theory-and-practice-of-logic-programming/article/power-of-negation-in-higherorder-datalog/F29B686E15B1D940647C9C500E335194}{Cambridge}
\item Kuper, L. \& Newton, R.R. (2023). "Breaking the Negative Cycle." \emph{ECOOP 2023}.
\href{https://drops.dagstuhl.de/storage/00lipics/lipics-vol263-ecoop2023/LIPIcs.ECOOP.2023.31/LIPIcs.ECOOP.2023.31.pdf}{PDF}
\end{itemize}
\subsection{8.8 Prologos Internal Documents}
\label{sec:org43d3c2a}

\begin{itemize}
\item \texttt{EFFECTFUL\_COMPUTATION\_ON\_PROPAGATORS.org} — Layered Recovery Principle (canonical)
\item \texttt{2026-03-06\_SESSION\_TYPES\_AS\_EFFECT\_ORDERING.org} — System II design
\item \texttt{2026-02-24\_LOGIC\_ENGINE\_DESIGN.org} — System I design
\item \texttt{2026-03-13\_TRACK2\_REACTIVE\_RESOLUTION\_DESIGN.md} — System III design
\item \texttt{2026-02-27\_1026\_GALOIS\_CONNECTIONS\_ABSTRACT\_INTERPRETATION.md} — Galois connections research
\item \texttt{2026-03-11\_PROPAGATOR\_FIRST\_PIPELINE\_AUDIT.md} — Full system audit
\item \texttt{DESIGN\_PRINCIPLES.org} — Data Orientation principle
\end{itemize}
\end{document}
